app/views/pedidos/_form.html.erb

SELECT "usuarios".* FROM "usuarios"  ORDER BY "usuarios"."nome" ASC
---
    <%= f.label :usuario_id %><br>
    <%= f.collection_select :usuario_id, Usuario.order(:nome),:id,:nome, include_blank: true %>