app/views/pedidos/_form.html.erb

SELECT "usuarios".* FROM "usuarios"  ORDER BY "usuarios"."email" ASC
---
      <div class="col-sm-8">
        <%= f.collection_select :usuario_id, Usuario.order(:email),:id,:email, include_blank: true, class: 'form-control' %>

SELECT "encomendas".* FROM "encomendas"  ORDER BY "encomendas"."dataentrega" ASC
---
      <div class="col-sm-8">
        <%= f.collection_select :encomenda_id, Encomenda.order(:dataentrega),:id,:dataentrega, include_blank: true, class: 'form-control' %>