app/views/produtos/_form.html.erb

SELECT "categorizacaos".* FROM "categorizacaos"  ORDER BY "categorizacaos"."nome" ASC
---
      <div class="col-sm-8">
        <%= f.collection_select :categorizacao_id, Categorizacao.order(:nome),:id,:nome, include_blank: true, class: 'form-control' %>

SELECT "unidades".* FROM "unidades"  ORDER BY "unidades"."nome" ASC
---
      <div class="col-sm-8">
        <%= f.collection_select :unidade_id, Unidade.order(:nome),:id,:nome, include_blank: true, class: 'form-control' %>