app/controllers/categorizacaos_controller.rb

SELECT "categorizacaos".* FROM "categorizacaos"
---
  def index
    @categorizacaos = Categorizacao.all

INSERT INTO "categorizacaos" ("nome", "descricao", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["nome", "Frutas"], ["descricao", "Frutas"], ["created_at", "2017-05-18 05:00:13.929974"], ["updated_at", "2017-05-18 05:00:13.929974"]]
---
  def create
    @categorizacao = Categorizacao.new(categorizacao_params)

    respond_to do |format|
      if @categorizacao.save

SELECT  "categorizacaos".* FROM "categorizacaos" WHERE "categorizacaos"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_categorizacao
      @categorizacao = Categorizacao.find(params[:id])