app/controllers/control_usuarios_controller.rb

SELECT "usuarios".* FROM "usuarios"
---
  def index
  	@usuarios = Usuario.all