app/controllers/encomendas_controller.rb

  def index
    @encomendas = Encomenda.all
---
SELECT "encomendas".* FROM "encomendas"

  def create
    @encomenda = Encomenda.new(encomenda_params)

    respond_to do |format|
      if @encomenda.save
---
INSERT INTO "encomendas" ("endereco_id", "dataentrega", "datalimitepedido", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @encomenda.update(encomenda_params)
---
UPDATE "encomendas" SET "dataentrega" = ?, "datalimitepedido" = ?, "updated_at" = ? WHERE "encomendas"."id" = ?  [["dataentrega", "2017-05-30 11:37:00.000000"], ["datalimitepedido", "2017-05-28 11:37:00.000000"], ["updated_at", "2017-05-21 13:47:20.953777"], ["id", 1]]

  def destroy
    @encomenda.destroy
---
DELETE FROM "encomendas" WHERE "encomendas"."id" = ?  [["id", 1]]

    def set_encomenda
      @encomenda = Encomenda.find(params[:id])
---
SELECT  "encomendas".* FROM "encomendas" WHERE "encomendas"."id" = ? LIMIT 1  [["id", 1]]