app/controllers/enderecos_controller.rb

SELECT "enderecos".* FROM "enderecos"
---
  def index
    @enderecos = Endereco.all

INSERT INTO "enderecos" ("logradouro", "numero", "cep", "bairro", "municipio", "estado", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @endereco = Endereco.new(endereco_params)

    respond_to do |format|
      if @endereco.save

SELECT  "enderecos".* FROM "enderecos" WHERE "enderecos"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_endereco
      @endereco = Endereco.find(params[:id])