app/controllers/pedidos_controller.rb

  def index
    @pedidos = Pedido.all
---
SELECT "pedidos".* FROM "pedidos"

  def new
    @pedido = Pedido.new
    Produto.all.each do |prod|
---
SELECT "produtos".* FROM "produtos"

  def create

    @pedido.itempedidos do |ip|

    end

    @pedido = Pedido.new(pedido_params)

    respond_to do |format|
      if @pedido.save
---
INSERT INTO "itempedidos" ("produto_id", "quantidade", "pedido_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["produto_id", 1], ["quantidade", 3], ["pedido_id", 4], ["created_at", "2017-05-21 13:05:35.626869"], ["updated_at", "2017-05-21 13:05:35.626869"]]
INSERT INTO "pedidos" ("usuario_id", "encomenda_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["usuario_id", 0], ["encomenda_id", 0], ["created_at", "2017-05-18 23:27:58.530249"], ["updated_at", "2017-05-18 23:27:58.530249"]]

  def destroy
    @pedido.destroy
---
DELETE FROM "pedidos" WHERE "pedidos"."id" = ?  [["id", 1]]

    def set_pedido
      @pedido = Pedido.find(params[:id])
---
SELECT  "pedidos".* FROM "pedidos" WHERE "pedidos"."id" = ? LIMIT 1  [["id", 7]]