app/controllers/pedidos_controller.rb

SELECT "categorizacaos".* FROM "categorizacaos"
---
    def set_categorias
      @categorias = Categorizacao.all