app/controllers/produtos_controller.rb

  def index
    @produtos = Produto.all
---
SELECT "produtos".* FROM "produtos"

  def create
    @produto = Produto.new(produto_params)

    respond_to do |format|
      if @produto.save
---
INSERT INTO "produtos" ("categorizacao_id", "unidade_id", "nome", "descricao", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["categorizacao_id", 1], ["unidade_id", 1], ["nome", ""], ["descricao", ""], ["created_at", "2017-05-24 11:24:37.911138"], ["updated_at", "2017-05-24 11:24:37.911138"]]

  def update
    respond_to do |format|
      if @produto.update(produto_params)
---
UPDATE "produtos" SET "unidade_id" = ?, "descricao" = ?, "updated_at" = ? WHERE "produtos"."id" = ?  [["unidade_id", 5], ["descricao", "penca"], ["updated_at", "2017-05-22 02:14:42.050376"], ["id", 1]]

  def destroy
    @produto.destroy
---
DELETE FROM "produtos" WHERE "produtos"."id" = ?  [["id", 3]]

    def set_produto
      @produto = Produto.find(params[:id])
---
SELECT  "produtos".* FROM "produtos" WHERE "produtos"."id" = ? LIMIT 1  [["id", 3]]