app/controllers/unidades_controller.rb

  def index
    @unidades = Unidade.all
---
SELECT "unidades".* FROM "unidades"

  def create
    @unidade = Unidade.new(unidade_params)

    respond_to do |format|
      if @unidade.save
---
INSERT INTO "unidades" ("nome", "descricao", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["nome", "dz"], ["descricao", "dúzia"], ["created_at", "2017-05-18 05:01:49.102706"], ["updated_at", "2017-05-18 05:01:49.102706"]]

  def update
    respond_to do |format|
      if @unidade.update(unidade_params)
---
UPDATE "unidades" SET "nome" = ?, "descricao" = ?, "updated_at" = ? WHERE "unidades"."id" = ?  [["nome", "un"], ["descricao", "unidade"], ["updated_at", "2017-05-21 13:42:40.445718"], ["id", 4]]

    def set_unidade
      @unidade = Unidade.find(params[:id])
---
SELECT  "unidades".* FROM "unidades" WHERE "unidades"."id" = ? LIMIT 1  [["id", 3]]