app/controllers/usuarios_controller.rb

SELECT "usuarios".* FROM "usuarios"
---
  def index
    @usuarios = Usuario.all

INSERT INTO "usuarios" ("nome", "email", "senha", "admin", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["nome", "Rafael"], ["email", "gloria.rafael@gmail.com"], ["senha", "lelis1004"], ["admin", "t"], ["created_at", "2017-05-18 05:02:08.921654"], ["updated_at", "2017-05-18 05:02:08.921654"]]
---
  def create
    @usuario = Usuario.new(usuario_params)

    respond_to do |format|
      if @usuario.save

UPDATE "usuarios" SET "nome" = ?, "admin" = ?, "updated_at" = ? WHERE "usuarios"."id" = ?  [["nome", "Rafael"], ["admin", "f"], ["updated_at", "2017-05-22 11:30:27.302335"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @usuario.update(usuario_params)

SELECT  "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = ?  ORDER BY "usuarios"."id" ASC LIMIT 1  [["id", 1]]
---
    def set_usuario
      @usuario = Usuario.find(params[:id])