app/views/encomendas/_form.html.erb

    <div class="col-sm-8">
      <%= f.collection_select :endereco_id, Endereco.order(:logradouro),:id,:logradourocomnumero, include_blank: true, class: 'form-control' %>
---
SELECT "enderecos".* FROM "enderecos"  ORDER BY "enderecos"."logradouro" ASC